def generate_level(level_num):
    """
    Генерирует уровень на основе номера уровня.

    Args:
        level_num (int): Номер уровня.

    Returns:
        tuple: Кортеж, содержащий карту уровня и список комнат.
    """
    if level_num == 1:
        level = [
            "#####################",
            "#bbbbbbbbpbbbbbbbbb#",
            "#b##d########d####b#",
            "#b#...#..........#b#",
            "#b#...#..........#b#",
            "#b#...############b#",
            "#b#####...#......#b#",
            "#b#.......#......#b#",
            "#b#.......#......fb#",
            "#b#.......#......#b#",
            "#bf.......#......###",
            "####################",
        ]
        rooms = [2, 3, 2, 2]

    elif level_num == 2:
        level = [
            "#####################",
            "#bbbbbbbbpbbbbbbbbb#",
            "#b##d###d####d######",
            "#b#...#...#......###",
            "#b#...#...#......###",
            "#b#...#####......###",
            "#b#.......#......###",
            "#b#.......#......###",
            "#b#.......#......###",
            "#b####....#......###",
            "#bf..#....#......###",
            "####################",
        ]
        rooms = [3, 4, 2, 2]
    elif level_num == 3:
        level = [
            "#####################",
            "#bbbbbbbbpbbb#.....#",
            "#b##d#######b#.....#",
            "#b#........#bf.....#",
            "#b##########b#.....#",
            "#bbbbbbbbbbbb#######",
            "###d###d###d########",
            "#....#....#........#",
            "#....#....#........#",
            "#....#....#........#",
            "#....#....#........#",
            "####################",
        ]
        rooms = [2, 4, 5, 3, 2]

    elif level_num == 4:
        level = [
            "#####################",
            "#bbbbbbbbpbbbbbbbbb#",
            "#b##d#############b#",
            "#b#...#..........#b#",
            "#b#...#..........#b#",
            "#b#...#d##########b#",
            "#b#####bbbbbbbb#.db#",
            "#bbbbbbbbbbbbbb#####",
            "#b###########d######",
            "#b#.......#......###",
            "#bf.......#......###",
            "####################",
        ]
        rooms = [2, 4, 2, 7, 4]

    else:
        # Возвращаем пустой уровень
        return [], []

    return level, rooms


def rooms_per_level(level_num):
    """
    Возвращает количество комнат на уровне.

    Args:
        level_num (int): Номер уровня.

    Returns:
        int: Количество комнат на уровне.
    """
    ans = [4, 4, 5, 5]

    return ans[level_num - 1]
