def generate_level(level_num):
    """
    Генерирует уровень на основе номера уровня.

    Args:
        level_num (int): Номер уровня.

    Returns:
        tuple: Кортеж, содержащий карту уровня и список комнат.
    """
    if level_num == 1:
        level = [
            "#####################",
            "#bbbbbbbbpbbbbbbbbb#",
            "#b##d########d####b#",
            "#b#...#..........#b#",
            "#b#...#..........#b#",
            "#b#...############b#",
            "#b#####...#......#b#",
            "#b#.......#......#b#",
            "#b#.......#......db#",
            "#b#.......#......#b#",
            "#bd.......#......###",
            "####################",
        ]
        rooms = [
            # TODO
        ]

    else:
        # Возвращаем пустой уровень
        return [], []

    return level, rooms
